{
  "_name_or_path": "google/siglip-base-patch16-224",
  "architectures": [
    "SiglipModel"
  ],
  "initializer_factor": 1.0,
  "model_type": "siglip",
  "text_config": {
    "model_type": "siglip_text_model",
    "torch_dtype": "float32"
  },
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "vision_config": {
    "model_type": "siglip_vision_model",
    "torch_dtype": "float32"
  }
}
